docs: actualizar diagrama de clases
